In [1]:
import pandas as pd

In [124]:
df = pd.read_html('https://sos.ga.gov/elections/election_results/2010_1102/03600.htm')

In [125]:
df = df[2]

In [126]:
df.shape

(7, 6)

In [127]:
df.head(5)

         0     1                     2               3   4   5
0      NaN   NaN  Edwards (NP)  52,903  Totals  52,903 NaN NaN
1      NaN   NaN                100.0%          100.0% NaN NaN
2   County   PPR                   NaN             NaN NaN NaN
3  FAYETTE  100%                 29383           29383 NaN NaN
4     PIKE  100%                  4767            4767 NaN NaN

In [128]:
df = df[3:]

In [129]:
df.head(5)

          0     1      2      3   4   5
3   FAYETTE  100%  29383  29383 NaN NaN
4      PIKE  100%   4767   4767 NaN NaN
5  SPALDING  100%  12867  12867 NaN NaN
6     UPSON  100%   5886   5886 NaN NaN

In [130]:
df = df[df.columns[[0,2]]]

In [131]:
df.head(5)

          0      2
3   FAYETTE  29383
4      PIKE   4767
5  SPALDING  12867
6     UPSON   5886

In [132]:
df.columns = ['county', 'Chris Edwards']

In [133]:
df.tail(5)

     county Chris Edwards
3   FAYETTE         29383
4      PIKE          4767
5  SPALDING         12867
6     UPSON          5886

In [134]:
df = df.melt(id_vars=['county'])

In [135]:
df.columns = ['county', 'candidate', 'votes']

In [136]:
df.head()

     county      candidate  votes
0   FAYETTE  Chris Edwards  29383
1      PIKE  Chris Edwards   4767
2  SPALDING  Chris Edwards  12867
3     UPSON  Chris Edwards   5886

In [137]:
df['votes'] = df['votes'].astype(int)

In [138]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   county     4 non-null      object
 1   candidate  4 non-null      object
 2   votes      4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [139]:
df['office'] = 'Superior Court Judge'
df['district'] = 'Griffin Circuit'
df['party'] = 'Nonpartisan'
# df['party'] = 'Democrat'
# df['party'] = 'Republican'

In [140]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate      party
Chris Edwards  Nonpartisan    52903
Name: votes, dtype: int64

In [141]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,FAYETTE,Superior Court Judge,Griffin Circuit,Nonpartisan,Chris Edwards,29383
1,PIKE,Superior Court Judge,Griffin Circuit,Nonpartisan,Chris Edwards,4767
2,SPALDING,Superior Court Judge,Griffin Circuit,Nonpartisan,Chris Edwards,12867
3,UPSON,Superior Court Judge,Griffin Circuit,Nonpartisan,Chris Edwards,5886

In [142]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')